tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "jesseduffield/lazygit"

brew "awscli"
brew "bash"
brew "coreutils"
brew "ctags"
brew "gh"
brew "git"
brew "git-crypt"
brew "git-delta"
brew "gpg"
brew "htop"
brew "hub"
brew "java"
brew "jq"
brew "lazygit"
brew "libffi"
brew "libyaml"
brew "ncdu"
brew "node" # for Github CoPilot
brew "openssl"
brew "parallel"
brew "readline"
brew "stow"
brew "terminal-notifier"
brew "tree"
brew "wakeonlan"
brew "watch"
brew "wget"
brew "zsh"

cask "alacritty"
cask "barrier"
cask "discord"
cask "docker"
cask "dropbox"
cask "firefox-developer-edition"
cask "font-sauce-code-pro-nerd-font"
cask "font-source-code-pro"
cask "iterm2"
cask "karabiner-elements"
cask "keepassxc"
cask "macvim"
cask "protonvpn"
cask "rectangle"
cask "simplenote"
cask "skype"
cask "slack"
cask "spotify"
cask "the-unarchiver"
cask "vlc"
cask "obsidian"
