tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "juanibiapina/homebrew-taps"

brew "antr"
brew "asdf"
brew "awscli"
brew "bash"
brew "bat"
brew "coreutils"
brew "ctags"
brew "curlie"
brew "direnv"
brew "fzf"
brew "gh"
brew "git"
brew "git-crypt"
brew "git-delta"
brew "gpg"
brew "htop"
brew "hub"
brew "hyperfine"
brew "java"
brew "jq"
brew "libffi"
brew "libyaml"
brew "ncdu"
brew "neovim", args: ["HEAD"]
brew "node" # for Github CoPilot
brew "openssl"
brew "pandoc"
brew "parallel"
brew "rbenv"
brew "rbenv-default-gems"
brew "readline"
brew "ripgrep"
brew "sk"
brew "starship"
brew "stow"
brew "sub"
brew "svn"
brew "terminal-notifier"
brew "tmux"
brew "tree"
brew "watch"
brew "wget"
brew "zsh"

cask "alacritty"
cask "alfred3"
cask "barrier"
cask "discord"
cask "docker"
cask "dropbox"
cask "firefox-developer-edition"
cask "font-source-code-pro"
cask "iterm2"
cask "karabiner-elements"
cask "keepassxc"
cask "macvim"
cask "protonvpn"
cask "simplenote"
cask "skype"
cask "slack"
cask "spectacle"
cask "spotify"
cask "the-unarchiver"
cask "vlc"
cask "whatsapp"
cask "wkhtmltopdf"
