tap "caskroom/versions"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "orf/brew"

brew "asdf"
brew "bash"
brew "coreutils"
brew "ctags"
brew "fzf"
brew "git"
brew "git-delta"
brew "gpg"
brew "htop"
brew "hub"
brew "hyperfine"
brew "jq"
brew "libffi"
brew "libyaml"
brew "ncdu"
brew "neovim", args: ["HEAD"]
brew "openssl"
brew "pandoc"
brew "rbenv"
brew "rbenv-default-gems"
brew "readline"
brew "ripgrep"
brew "ruby-build"
brew "sk"
brew "starship"
brew "stow"
brew "terminal-notifier"
brew "tmux"
brew "wget"
brew "zsh"

cask "alfred3"
cask "docker"
cask "drawio"
cask "dropbox"
cask "firefox-developer-edition"
cask "font-source-code-pro"
cask "gimp"
cask "java"
cask "karabiner-elements"
cask "keepassxc"
cask "kitty"
cask "macvim"
cask "skype"
cask "slack"
cask "spectacle"
cask "spotify"
cask "the-unarchiver"
cask "vagrant"
cask "virtualbox"
cask "vlc"
cask "whatsapp"
cask "wkhtmltopdf"
